seryi2035/stm32002/proj005cmakeC6T6/Core/src/main.c
#include "stm32f10x.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_pwr.h"
#include "stm32f10x_usart.h"
#include "stm32f10x_bkp.h"
//#include "stdio.h"  //для теста
//#include "misc.h"
//#include "001.h"
#include "tim2_delay.h"
//#include "onewire.h"
#include <string.h>
//#include "libmodbus.h"
//#include "modbus.h"









//#include "stm32f10x.h"
//#include "stm32f10x_bkp.h"

#define PERIOD 1000
#define SYSCLK 72000000
#define PRESCALER 72

#define RX_BUF_SIZE 80
static volatile int temp;
static volatile char RX_FLAG_END_LINE;
static volatile unsigned int RXi;
static volatile char RXc;
static char RX_BUF[RX_BUF_SIZE]; //= {"\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0"};
//static u8 RX_BUF08[RX_BUF_SIZE];
//static char buffer[80];// = {"\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0"};
static volatile int TimeResult;
static volatile int iResult;
static volatile float fResult;
static volatile int TimeSec;
static volatile uint8_t TimeState;
static volatile uint8_t FLAG_ECHO;
//static uint16_t ds18b20Value;
// (UnixTime = 00:00:00 01.01.1970 = JD0 = 2440588)
#define JULIAN_DATE_BASE    2440588

void GETonGPIO(void);
#define USART1PPport GPIOA
#define USART1PPpin GPIO_Pin_11
void usart1_init(void);
void USART1_IRQHandler(void);
#define USARTSend USART1Send485
void clear_RXBuffer(void);
void USART01Send(u8 *pucBuffer);
void USART1Send(char *pucBuffer);
void USART1Send485(char *pucBuffer);
unsigned char RTC_Init(void);

char get_ab_xFF(int a);
u8 convT_DS18B20(u8 LSB, u8 MSB);
void schitatTemp(char* imya);
void vvhex(char vv);
void sendaddrow (void);

//float schitatfTemp(char* imya);
uint16_t schitatU16Temp(char* imya);
uint16_t schitatU16Temp05(char* imya);
void oprosite (void);

#define DHT11_SUCCESS         1
#define DHT11_ERROR_CHECKSUM  2
#define DHT11_ERROR_TIMEOUT   3


void wwdgenable(void);
void WWDG_IRQHandler(void);
void iwdg_init(void);

static uint16_t millisec2;
static uint32_t globalsecs;
static uint32_t millisec003delay_ms;
void SETglobalsecs(uint32_t count);
uint32_t GETglobalsecs(void);


void TIM2_init(void);
void TIM2_IRQHandler(void);
void delay_us(uint32_t n_usec);
void delay_ms(uint32_t n_msec);
void TIM4_init(void);
void TIM4_IRQHandler(void);
void TIM3_init(void);
void TIM3_IRQHandler(void);

void GPIO_ToggleBits(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);

//static uint16_t servo001max;
//static uint16_t servo001min;
static uint16_t servo001use;
//static uint16_t servo002max;
//static uint16_t servo002min;
static uint16_t servo002use;
//static uint16_t servo003max;
//static uint16_t servo003min;
static uint16_t servo003use;
//static uint16_t servo004max;
//static uint16_t servo004min;
static uint16_t servo004use;
//static uint16_t servo005max;
//static uint16_t servo005min;
static uint16_t servo005use;
//void SERVOinit(void);


//MODBUS
//#include "modbus.h"
#define OBJ_SZ 36 //это количество объектов
#define SETUP 4 //это просто количество данных в массиве 0-элемент которого означает адрес
//PARAMETERRS ARRAY 0 PARAMETER = MODBUS ADDRESS
static uint8_t SET_PAR[SETUP];//0-элемент это адрес
//OBJECT ARRAY WHERE READING AND WRITING OCCURS
//uint16_t res_table[OBJ_SZ];//массив с объектами то откуда мы читаем и куда пишем
//float res_ftable[OBJ_SZ];
//buffer uart
#define BUF_SZ 128 //размер буфера
#define MODBUS_WRD_SZ (BUF_SZ-5)/2 //максимальное количество регистров в ответе
//uart structure
typedef struct UART_DATA {
    uint8_t buffer[128];//буфер
    uint16_t rxtimer;//этим мы считаем таймоут
    uint8_t rxcnt; //количество принятых символов
    uint8_t txcnt;//количество переданных символов
    uint8_t txlen;//длина посылки на отправку
    uint8_t volatile rxgap;//окончание приема
    uint8_t protocol;//тип протокола - здесь не используется
    uint16_t delay;//задержка
    uint8_t ddddddDOBAVKA[1];
} UART_DATA;
struct UART_DATA uart1;//структуры для соответсвующих усартов
//timer 0.0001sec one symbol on 9600 ~1ms
//uart3.delay=30; //modbus gap 9600
//uart3.delay=10; //modbus gap 38400
// /////////////////////////////////////////////////////////////////////////////////////////////////////
void net_tx1(UART_DATA *uart);
void MODBUS_SLAVE(UART_DATA *MODBUS);//функция обработки модбас и формирования ответа
void TX_06(UART_DATA *MODBUS);
void TX_EXCEPTION(UART_DATA *MODBUS,unsigned char error_type);

void TX_01(UART_DATA *MODBUS);
void TX_02(UART_DATA *MODBUS);

static uint8_t Coils_RW[OBJ_SZ];
static uint8_t Discrete_Inputs_RO[OBJ_SZ];
void setCOILS(uint8_t *Coils_RW);
void read_Discrete_Inputs_RO(void);
//void startCOILS(uint8_t *Coils_RW);
void read_Coils_RW(void);
void TX_05(UART_DATA *MODBUS);
void TX_04(UART_DATA *MODBUS);
void TX_03(UART_DATA *MODBUS);
union FloatU8  {
    float tmp_val_float;
    uint8_t tmp_val_u8[4];
    uint32_t tmp_val_u32;
    uint16_t tmp_val_u16[2];
    int16_t tmp_val_i16[2];
    int32_t tmp_val_i32;
} f001;
//typedef union FloatU8 ;
void coilTOback(void);
void coilFROMback(void);
void TX_16(UART_DATA *MODBUS);
typedef union   {
    float tmp_float[OBJ_SZ];
    uint8_t tmp_u8[OBJ_SZ*4];
    uint32_t tmp_u32[OBJ_SZ];
    uint16_t tmp_u16[OBJ_SZ*2];
    int16_t tmp_i16[OBJ_SZ*2];
    int32_t tmp_i32[OBJ_SZ];
} REGISTRS001;
static REGISTRS001 hold_reg;
static REGISTRS001 input_reg;
//hold_reg, input_reg;

void rs485GPIOon (void);
void rs485GPIOoff (void);


void atSTART(void);

void COILtimerMINUTES (uint8_t coilSETED, uint16_t inREGcount, uint16_t inREGbkp, uint16_t holdREGtimer, uint16_t holdREGbkp);

//счетчик воды
uint8_t waterplus;
uint8_t waterpluscount;
uint8_t waterplusSET;
uint16_t milisecondsfromSTART;
uint8_t gasplus;
uint8_t gaspluscount;
uint8_t gasplusSET;
uint32_t litrPERminutcountWATER;
uint32_t litrPERminutcountGAS;
void watercounter (void);//hold reg8-9 hold.u32 Nomer5      bcp27-28

