seryi2035/stm32002/proj005cmakeC6T6/Core/src/main.c
  }
}

void atSTART(void) {
  coilFROMback(); //######################################## coilFROMback();coilFROMback();coilFROMback(); BKP_DR2 BKP_DR1
  Coils_RW[8] = 0;

  //setCOILS(Coils_RW);
  //for(u8 i = 0; i < OBJ_SZ; i++) {
  //    input_reg.tmp_u32[i] = 0;
  //    hold_reg.tmp_u32[i] = 0;
  //  }
  /*hold_reg.tmp_u16[2] = BKP_ReadBackupRegister(BKP_DR29);
  hold_reg.tmp_u16[3] = BKP_ReadBackupRegister(BKP_DR30);
  hold_reg.tmp_u16[4] = BKP_ReadBackupRegister(BKP_DR23);
  hold_reg.tmp_u16[5] = BKP_ReadBackupRegister(BKP_DR24);*/

  hold_reg.tmp_u16[28] = BKP_ReadBackupRegister(BKP_DR9);   //timer01
  hold_reg.tmp_u16[29] = BKP_ReadBackupRegister(BKP_DR10);
  hold_reg.tmp_u16[30] = BKP_ReadBackupRegister(BKP_DR11);
  hold_reg.tmp_u16[31] = BKP_ReadBackupRegister(BKP_DR12);

  hold_reg.tmp_u16[10] = BKP_ReadBackupRegister(BKP_DR13); //servo001min hold.u6[10] BKP_DR13
  hold_reg.tmp_u16[11] = BKP_ReadBackupRegister(BKP_DR14); //servo001max hold.u6[11] BKP_DR14
  //servo001max = hold_reg.tmp_u16[11];
  //servo001use = 900;
  //servo001min = hold_reg.tmp_u16[10];
  hold_reg.tmp_u16[12] = BKP_ReadBackupRegister(BKP_DR15);
  hold_reg.tmp_u16[13] = BKP_ReadBackupRegister(BKP_DR16);
  //servo002max = hold_reg.tmp_u16[13];
  //servo002use = 500;
  //servo002min = hold_reg.tmp_u16[12];
  hold_reg.tmp_u16[14] = BKP_ReadBackupRegister(BKP_DR17);
  hold_reg.tmp_u16[15] = BKP_ReadBackupRegister(BKP_DR18);
  //servo003max = hold_reg.tmp_u16[15];
  //servo003use = 1000;
  //servo003min = hold_reg.tmp_u16[14];
  hold_reg.tmp_u16[16] = BKP_ReadBackupRegister(BKP_DR19);
  hold_reg.tmp_u16[17] = BKP_ReadBackupRegister(BKP_DR20);
  //servo004max = hold_reg.tmp_u16[17];
  //servo004use = 1000;
  //servo004min = hold_reg.tmp_u16[16];
  hold_reg.tmp_u16[18] = BKP_ReadBackupRegister(BKP_DR21);
  hold_reg.tmp_u16[19] = BKP_ReadBackupRegister(BKP_DR22);

  hold_reg.tmp_u16[20] = BKP_ReadBackupRegister(BKP_DR23); //goal100
  hold_reg.tmp_u16[21] = BKP_ReadBackupRegister(BKP_DR24); // gisterezis100
  hold_reg.tmp_float[1] = (float) ((float) hold_reg.tmp_u16[20] /100.0);
  hold_reg.tmp_float[2] = (float) ((float) hold_reg.tmp_u16[21] /100.0);
  //servo005max = hold_reg.tmp_u16[19];
  //servo005use = 1000;
  //servo005min = hold_reg.tmp_u16[18];
  //WATER COUNT
  input_reg.tmp_u16[22] = BKP_ReadBackupRegister(BKP_DR27);
  input_reg.tmp_u16[23] = BKP_ReadBackupRegister(BKP_DR28);
  input_reg.tmp_u16[24] = BKP_ReadBackupRegister(BKP_DR25);
  input_reg.tmp_u16[25] = BKP_ReadBackupRegister(BKP_DR26);
  setCOILS(Coils_RW);

waterplus=0;
waterpluscount=0;
waterplusSET=1;
gasplus=0;
gaspluscount=0;
gasplusSET=1;
}

void COILtimerMINUTES (uint8_t coilSETED, uint16_t inREGcount,uint16_t inREGbkp, uint16_t holdREGtimer ,uint16_t holdREGbkp) {
  input_reg.tmp_u16[inREGcount] = BKP_ReadBackupRegister(inREGbkp);

  if ( Coils_RW[coilSETED] != 0) {
      input_reg.tmp_u16[inREGcount]--;
    } else {
      input_reg.tmp_u16[inREGcount] = hold_reg.tmp_u16[holdREGtimer];
    }
  if (input_reg.tmp_u16[inREGcount] <= 1) {
      Coils_RW[coilSETED] = 0;
    }
  BKP_WriteBackupRegister(inREGbkp, input_reg.tmp_u16[inREGcount]);
  BKP_WriteBackupRegister(holdREGbkp, hold_reg.tmp_u16[holdREGtimer]);
}


void GETonGPIO() { //PP B(/10/1/0) C13 A(7/6) | IPU B4 | IPD B8 FLOAT B9
  GPIO_InitTypeDef GPIO_InitStructure;
  //LED C.13
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

  //A6 PP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  // ///////// 4 OUT B11 B10 B1 B0
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
  // B11 PP
  /*GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);*/
  //B 10 PP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  // B1 PP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  //B 0 PP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  //KNOPKA B3 IPU
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  //RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  // A7 IPU
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  // A6 IPU
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  // A5 IPU
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  //KNOPKA B4 IPU
  //RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

}
void usart1_init(void) { //USART 1 and GPIO A (9/10/11) ON A11pp
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA, ENABLE);
  //NVIC
  NVIC_InitTypeDef NVIC_InitStructure;
  NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  //GPIO
  GPIO_InitTypeDef GPIO_InitStructure;
  //  A 9 TX
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  //  A 10 RX
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  //GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  // A11 PP
  GPIO_InitStructure.GPIO_Pin = USART1PPpin;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(USART1PPport, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  //  USART 1
  USART_InitTypeDef USART_InitStructure;

