seryi2035/stm32002/proj005cmakeC6T6/Core/src/main.c
        }
    }

  //verify the Checksum
  if(data[4] != (u8) (data[0] + data[2] + data[1] + data[3]))
    return DHT11_ERROR_CHECKSUM;
  //set data
  dev->temparature = data[2];
  dev->pointtemparature = data[3];
  dev->humidity = data[0];
  return DHT11_SUCCESS;
}
*/
void wwdgenable(void){
  // Enable Watchdog
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_WWDG,ENABLE);
  WWDG_DeInit();
  WWDG_SetPrescaler(WWDG_Prescaler_8); //1, 2, 4, 8
  WWDG_SetWindowValue(127); // 64...127
  WWDG_Enable(100);
  WWDG_EnableIT();

  NVIC_InitTypeDef NVIC_InitStructure;
  NVIC_InitStructure.NVIC_IRQChannel = WWDG_IRQn;    //WWDG interrupt
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);   // NVIC initialization
}
void WWDG_IRQHandler(void) {
  //int i;
  WWDG_ClearFlag(); //This function reset flag WWDG->SR and cancel the resetting
  WWDG_SetCounter(100);

  // Toggle LED which connected to PC13
  GPIOC->ODR ^= GPIO_Pin_13;
}
void iwdg_init(void) {
  // включаем LSI
  RCC_LSICmd(ENABLE);
  while (RCC_GetFlagStatus(RCC_FLAG_LSIRDY) == RESET);
  // разрешается доступ к регистрам IWDG
  IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
  // устанавливаем предделитель
  IWDG_SetPrescaler(IWDG_Prescaler_256);
  // значение для перезагрузки
  IWDG_SetReload(0x300); //256/40000*0x300=4.9152
  // перезагрузим значение
  IWDG_ReloadCounter();
  // LSI должен быть включен
  IWDG_Enable();
}

void SETglobalsecs(uint32_t count) {

    BKP_WriteBackupRegister(BKP_DR3, ((uint16_t) (count >> 16)));
    BKP_WriteBackupRegister(BKP_DR4, ((uint16_t) count));
}
uint32_t GETglobalsecs(void) {
    return (((uint32_t) BKP_ReadBackupRegister(BKP_DR3) << 16) + ((uint32_t) BKP_ReadBackupRegister(BKP_DR4)));
}
void TIM2_init(void) {

  /*
  TIM_TimeBaseInitTypeDef TIMER_InitStructure;
  NVIC_InitTypeDef  NVIC_InitStructure;

  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
  TIM_TimeBaseStructInit(&TIMER_InitStructure);

  TIMER_InitStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIMER_InitStructure.TIM_Prescaler = 36000;
  TIMER_InitStructure.TIM_Period = 49999;
  TIM_TimeBaseInit(TIM2, &TIMER_InitStructure);
  TIM_Cmd(TIM2, ENABLE);

  NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  // ñ÷èòàåì îäèí ðàç
  TIM_SelectOnePulseMode(TIM2, TIM_OPMode_Single);
  NVIC_EnableIRQ(TIM2_IRQn);
  */

   TIM_TimeBaseInitTypeDef TIMER_InitStructure;
   RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
   TIM_TimeBaseStructInit(&TIMER_InitStructure);

   TIMER_InitStructure.TIM_Prescaler = 71;
   TIMER_InitStructure.TIM_Period = 19999;
   TIMER_InitStructure.TIM_CounterMode = TIM_CounterMode_Up;
   TIM_TimeBaseInit(TIM2, &TIMER_InitStructure);

   TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
   //SERVOinit();
    TIM_Cmd(TIM2, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA , ENABLE);

  GPIO_InitTypeDef GPIO_InitStructure;
  // Настроим ногу (PA1)A3 к которой подключен сервопривод
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 |GPIO_Pin_3;
  //Будем использовать альтернативный режим а не обычный GPIO
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

TIM_OCInitTypeDef timerPWM;
  TIM_OCStructInit (&timerPWM);
  timerPWM.TIM_Pulse = 900;
  timerPWM.TIM_OCMode = TIM_OCMode_PWM1;
  timerPWM.TIM_OutputState = TIM_OutputState_Enable;
  timerPWM.TIM_OCPolarity = TIM_OCPolarity_High;
  TIM_OC2Init(TIM2, &timerPWM);
  TIM_OC4Init(TIM2, &timerPWM);

   NVIC_EnableIRQ(TIM2_IRQn);
}
void TIM2_IRQHandler(void) {
  if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET)   {
      millisec2 = millisec2 + 20;
      if (milisecondsfromSTART >= 2500 ) {
        watercounter();
      } else {
      milisecondsfromSTART = milisecondsfromSTART + 20;
      }
      if (millisec2 >= 1000) {
          globalsecs = GETglobalsecs();
          globalsecs++;
          SETglobalsecs(globalsecs);
          millisec2 = 0;
        //TIM_SetCounter(TIM2, 0);
      }
      TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
  }

}
void delay_us(uint32_t n_usec) {
  TIM4->CNT = 0;
  while (TIM4->CNT < n_usec);

}
void delay_ms(uint32_t n_msec) {
  millisec003delay_ms = 0;

  //for (millisec003delay_ms = 1000000; millisec003delay_ms !=0; millisec003delay_ms--) {
  //delay_us(1000);

  //}
  //TIM2->CNT = 0;
  //while (TIM2->CNT < (2 * n_msec)){}
  //n_msec = n_msec * 2;
  while (millisec003delay_ms <= n_msec);
}

void TIM4_init(void) {
  TIM_TimeBaseInitTypeDef TIM_TimBaseStructure;
  NVIC_InitTypeDef  NVIC_InitStructure;

  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);
  //Initialise TIMER4
  TIM_TimBaseStructure.TIM_Period = 19999;
  TIM_TimBaseStructure.TIM_Prescaler = 71;
  TIM_TimBaseStructure.TIM_ClockDivision = 0;
  TIM_TimBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInit(TIM4, &TIM_TimBaseStructure);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB , ENABLE);

  GPIO_InitTypeDef GPIO_InitStructure;
  // Настроим ногу (Pb6)B7 B9 к которой подключен сервопривод
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 |GPIO_Pin_7 | GPIO_Pin_9;
  //Будем использовать альтернативный режим а не обычный GPIO
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  TIM_OCInitTypeDef timerPWM;
  TIM_OCStructInit (&timerPWM);
  timerPWM.TIM_Pulse = 1000;
  timerPWM.TIM_OCMode = TIM_OCMode_PWM1;
  timerPWM.TIM_OutputState = TIM_OutputState_Enable;
  timerPWM.TIM_OCPolarity = TIM_OCPolarity_High;
  TIM_OC1Init(TIM4, &timerPWM);
  TIM_OC2Init(TIM4, &timerPWM);

  TIM_OC4Init(TIM4, &timerPWM);
  TIM_Cmd(TIM4, ENABLE);

  // NVIC Configuration
  // Enable the TIM4_IRQn Interrupt
  NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  NVIC_EnableIRQ(TIM4_IRQn);
  //и так есть основной void TIM2_init(void);
}
void TIM4_IRQHandler(void) {
  if (TIM_GetITStatus(TIM4, TIM_IT_Update) != RESET)
    {
      TIM_ClearITPendingBit(TIM4, TIM_IT_Update);
      //TimeSec++;
      //millisec003delay_ms = millisec003delay_ms + 20;
    }
}

void TIM3_init(void) {
  TIM_TimeBaseInitTypeDef TIMER_InitStructure;
  NVIC_InitTypeDef  NVIC_InitStructure;

  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
  //TIM_TimeBaseStructInit(&TIMER_InitStructure);

