seryi2035/stm32002/proj005cmakeC6T6/Core/src/main.c
}
void coilTOback(void) {
  u16 tmp_val_pos=0;
  u16 tmp001 = 0;
  for(u8 m=0;m<32;m++)  {

      if (tmp001 == 0) {
          tmp001 = 1;
        } else {
          tmp001 *= 2;
        }
      //читаем текущее значение
      if (Coils_RW[m]) {
          tmp_val_pos = tmp_val_pos + tmp001;
        }
      if (m == 15) {
          BKP_WriteBackupRegister(BKP_DR1,tmp_val_pos);
          tmp_val_pos = 0;
          tmp001 = 0;
        } else if (m == 31) {
          BKP_WriteBackupRegister(BKP_DR2,tmp_val_pos);
        }
    }
}
void coilFROMback(void) {
  u16 tmp_val_pos;
  tmp_val_pos = BKP_ReadBackupRegister(BKP_DR1);

  for(u8 m=0;m<32;m++)  {
      Coils_RW[m] = tmp_val_pos % 2;
      tmp_val_pos = tmp_val_pos / 2;
      if (m == 15) {
          tmp_val_pos = BKP_ReadBackupRegister(BKP_DR2);
        }
    }
}

/*void TX_16(UART_DATA *MODBUS) {
  uint16_t tmp, tmp1;
  uint16_t m=0,n=0;
  u8 i;
  //MODBUS[0] =SET_PAR[0]; // adress - stays a same as in recived
  //MODBUS[1] = 6; //query type - - stay a same as in recived
  ///2-3  - starting address
  tmp=((((uint16_t)MODBUS->buffer[2])<<8)+MODBUS->buffer[3]); //стратовый адрес для чтения
  //4-5 - number of registers
  tmp1=((((uint16_t)MODBUS->buffer[4])<<8)+MODBUS->buffer[5]);//количество регистров для чтения
  //default answer length if error
  n=3;

  if((((tmp+tmp1)<OBJ_SZ) && (tmp1<MODBUS_WRD_SZ+1)))    {
      for(m=0;m<tmp1;m++)   {
          i = m/2;


          MODBUS->buffer[n]=f001.tmp_val_u8[3];
          MODBUS->buffer[n+1]=f001.tmp_val_u8[2];
          MODBUS->buffer[n+2]=f001.tmp_val_u8[1];
          MODBUS->buffer[n+3]=f001.tmp_val_u8[0];
          f001.tmp_val_float=res_ftable[i+tmp];//пишем текущее значение
          m++; // ############# Второй раз)))))))))))
          n=n+4;
        }
      MODBUS->txlen=8;
    } else {
      //illegal data
      TX_EXCEPTION(MODBUS,0x02) ;
    }

}
*/
void TX_16(UART_DATA *MODBUS) {
  uint16_t tmp, tmp1;
  //uint16_t n=0;
  //u8 i;
  //MODBUS[0] =SET_PAR[0]; // adress - stays a same as in recived
  //MODBUS[1] = 6; //query type - - stay a same as in recived
  ///2-3  - starting address
  tmp=((((uint16_t)MODBUS->buffer[2])<<8)+MODBUS->buffer[3]); //стратовый адрес для чтения
  //2-3  - adress   , 4-5 - number of value 6==2 num bytes 7-8 value
  tmp1=((((uint16_t)MODBUS->buffer[4])<<8)+MODBUS->buffer[5]);//количество регистров для чтения
  //default answer length if error
  //MODBUS->buffer[6] == 2
  //n=7;
  if((((tmp+tmp1)<OBJ_SZ) && (tmp1<MODBUS_WRD_SZ+1)))    {
      hold_reg.tmp_u16[tmp] =((((uint16_t)MODBUS->buffer[7])<<8)+MODBUS->buffer[8]);

      MODBUS->txlen=8;
    } else {
      //illegal data
      TX_EXCEPTION(MODBUS,0x02) ;
    }

}
void rs485GPIOon (void) {
  GPIO_SetBits(GPIOA,GPIO_Pin_11);
  GPIO_ResetBits(GPIOA,GPIO_Pin_8);
}
void rs485GPIOoff (void) {
  GPIO_ResetBits(GPIOA,GPIO_Pin_11);
  GPIO_SetBits(GPIOA,GPIO_Pin_8);
}

void watercounter (void)
{
  if (Coils_RW[26] == 1) {
    if (litrPERminutcountWATER < 180000) {
      litrPERminutcountWATER++;
    } else {
    input_reg.tmp_u16[28] = 0;
    }
  }
  if(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_5)   == (uint8_t)Bit_SET) {

    if (waterplus == 1 ) {
      if (waterpluscount <= 9) {
        waterpluscount++;
          if (waterpluscount == 9) {
            waterplusSET =0;
          }
      } else {
        if (waterplusSET == 0 ) {
          input_reg.tmp_u32[11] = input_reg.tmp_u32[11] + 5;
          BKP_WriteBackupRegister(BKP_DR27, input_reg.tmp_u16[22]);
          BKP_WriteBackupRegister(BKP_DR28, input_reg.tmp_u16[23]);
          waterplusSET =1;
          if ( (Coils_RW[26] == 1) && (litrPERminutcountWATER > 10)) {
            input_reg.tmp_u16[28] = (uint16_t) (1800000 / litrPERminutcountWATER);
            litrPERminutcountWATER = 0;
          }
        }
      }
    } else {
    waterplus =1;
    waterpluscount =0;
    }
  }else{
    if (waterplus == 0 ) {
      if (waterpluscount <= 9) {
        waterpluscount++;
        if (waterpluscount == 9) {
          waterplusSET =0;
        }
      } else {
        if (waterplusSET == 0 ) {
          input_reg.tmp_u32[11] = input_reg.tmp_u32[11] + 5;
          BKP_WriteBackupRegister(BKP_DR27, input_reg.tmp_u16[22]);
          BKP_WriteBackupRegister(BKP_DR28, input_reg.tmp_u16[23]);
          waterplusSET =1;
        }
      }
    } else {
    waterplus =0;
    waterpluscount =0;
    }

  }
  if (Coils_RW[25] == 1) {
    if (litrPERminutcountGAS < 180000) {
      litrPERminutcountGAS++;
    } else {
    input_reg.tmp_u16[29] = 0;
    }
  }
  if(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_6)   == (uint8_t)Bit_SET) {

    if (gasplus == 1 ) {
      if (gaspluscount <= 9) {
        gaspluscount++;
          if (gaspluscount == 9) {
          gasplusSET =0;
          }
      } else {
        if (gasplusSET == 0 ) {
          input_reg.tmp_u32[12] = input_reg.tmp_u32[12] + 5;
          BKP_WriteBackupRegister(BKP_DR25, input_reg.tmp_u16[24]);
          BKP_WriteBackupRegister(BKP_DR26, input_reg.tmp_u16[25]);
          gasplusSET =1;
          if ((Coils_RW[25] == 1) && (litrPERminutcountGAS > 10) ) {
            input_reg.tmp_u16[29] = (uint16_t) (1800000 / litrPERminutcountGAS);
            litrPERminutcountGAS =0;
          }
        }
      }
    } else {
    gasplus =1;
    gaspluscount =0;
    }
  }else{
    if (gasplus == 0 ) {
      if (gaspluscount <= 9) {
        gaspluscount++;
          if (gaspluscount == 9) {
          gasplusSET =0;
          }
        } else {
        if (gasplusSET == 0 ) {
          input_reg.tmp_u32[12] = input_reg.tmp_u32[12] + 5;
          BKP_WriteBackupRegister(BKP_DR25, input_reg.tmp_u16[24]);
          BKP_WriteBackupRegister(BKP_DR26, input_reg.tmp_u16[25]);
          gasplusSET =1;
          }
        }
    } else {
    gasplus =0;
    gaspluscount =0;
    }

  }
}


uint8_t OW_Init() {              //инициализирует USART и DMA
  GPIO_InitTypeDef GPIO_InitStruct;
  USART_InitTypeDef USART_InitStructure;

  if (OW_USART == USART1) {
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO,
                             ENABLE);

      // USART TX
      GPIO_InitStruct.GPIO_Pin = GPIO_Pin_9;
      GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF_PP;
      GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;

