seryi2035/stm32002/proj005cmakeC6T6/Core/src/main.c
      GPIO_Init(GPIOA, &GPIO_InitStruct);

      // USART RX
      GPIO_InitStruct.GPIO_Pin = GPIO_Pin_10;
      GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IN_FLOATING;
      GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;

      GPIO_Init(GPIOA, &GPIO_InitStruct);

      RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

      RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
    }

  if (OW_USART == USART2) {
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO,
                             ENABLE);

      GPIO_InitStruct.GPIO_Pin = GPIO_Pin_2;
      GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF_PP;
      GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;

      GPIO_Init(GPIOA, &GPIO_InitStruct);

      GPIO_InitStruct.GPIO_Pin = GPIO_Pin_3;
      GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IN_FLOATING;
      GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;

      GPIO_Init(GPIOA, &GPIO_InitStruct);

      RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);

      RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
    }

  USART_InitStructure.USART_BaudRate = 115200;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl =
      USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;

  USART_Init(OW_USART, &USART_InitStructure);
  USART_Cmd(OW_USART, ENABLE);
  return OW_OK;
}
uint8_t OW_Send(uint8_t sendReset, uint8_t *command, uint8_t cLen,
                uint8_t *data, uint8_t dLen, uint8_t readStart) {
//-----------------------------------------------------------------------------
// процедура общения с шиной 1-wire
// sendReset - посылать RESET в начале общения.
// 		OW_SEND_RESET или OW_NO_RESET
// command - массив байт, отсылаемых в шину. Если нужно чтение - отправляем OW_READ_SLOT
// cLen - длина буфера команд, столько байт отошлется в шину
// data - если требуется чтение, то ссылка на буфер для чтения
// dLen - длина буфера для чтения. Прочитается не более этой длины
// readStart - с какого символа передачи начинать чтение (нумеруются с 0)
//		можно указать OW_NO_READ, тогда можно не задавать data и dLen
//-----------------------------------------------------------------------------


  // если требуется сброс - сбрасываем и проверяем на наличие устройств
  if (sendReset == OW_SEND_RESET) {
      if (OW_Reset() == OW_NO_DEVICE) {
          return OW_NO_DEVICE;
        }
    }

  while (cLen > 0) {

      OW_toBits(*command, ow_buf);
      command++;
      cLen--;

      OW_SendBits(8);

      // если прочитанные данные кому-то нужны - выкинем их в буфер
      if (readStart == 0 && dLen > 0) {
          *data = OW_toByte(ow_buf);
          data++;
          dLen--;
        } else {
          if (readStart != OW_NO_READ) {
              readStart--;
            }
        }
    }

  return OW_OK;
}
uint8_t OW_Scan(uint8_t *buf, uint8_t num) {


//-----------------------------------------------------------------------------
// Данная функция осуществляет сканирование сети 1-wire и записывает найденные
//   ID устройств в массив buf, по 8 байт на каждое устройство.
// переменная num ограничивает количество находимых устройств, чтобы не переполнить
// буфер.
//-----------------------------------------------------------------------------
  uint8_t found = 0;
  uint8_t *lastDevice;
  uint8_t *curDevice = buf;
  uint8_t numBit, lastCollision, currentCollision, currentSelection;

  lastCollision = 0;
  while (found < num) {
      numBit = 1;
      currentCollision = 0;

      // посылаем команду на поиск устройств
      OW_Send(OW_SEND_RESET, (uint8_t*)"\xf0", 1, 0, 0, OW_NO_READ);

      for (numBit = 1; numBit <= 64; numBit++) {
          // читаем два бита. Основной и комплементарный
          OW_toBits(OW_READ_SLOT, ow_buf);
          OW_SendBits(2);

          if (ow_buf[0] == OW_R_1) {
              if (ow_buf[1] == OW_R_1) {
                  // две единицы, где-то провтыкали и заканчиваем поиск
                  return found;
                } else {
                  // 10 - на данном этапе только 1
                  currentSelection = 1;
                }
            } else {
              if (ow_buf[1] == OW_R_1) {
                  // 01 - на данном этапе только 0
                  currentSelection = 0;
                } else {
                  // 00 - коллизия
                  if (numBit < lastCollision) {
                      // идем по дереву, не дошли до развилки
                      if (lastDevice[(numBit - 1) >> 3]
                          & 1 << ((numBit - 1) & 0x07)) {
                          // (numBit-1)>>3 - номер байта
                          // (numBit-1)&0x07 - номер бита в байте
                          currentSelection = 1;

                          // если пошли по правой ветке, запоминаем номер бита
                          if (currentCollision < numBit) {
                              currentCollision = numBit;
                            }
                        } else {
                          currentSelection = 0;
                        }
                    } else {
                      if (numBit == lastCollision) {
                          currentSelection = 0;
                        } else {
                          // идем по правой ветке
                          currentSelection = 1;

                          // если пошли по правой ветке, запоминаем номер бита
                          if (currentCollision < numBit) {
                              currentCollision = numBit;
                            }
                        }
                    }
                }
            }

          if (currentSelection == 1) {
              curDevice[(numBit - 1) >> 3] |= 1 << ((numBit - 1) & 0x07);
              OW_toBits(0x01, ow_buf);
            } else {
              curDevice[(numBit - 1) >> 3] &= ~(1 << ((numBit - 1) & 0x07));
              OW_toBits(0x00, ow_buf);
            }
          OW_SendBits(1);
        }
      found++;
      lastDevice = curDevice;
      curDevice += 8;
      if (currentCollision == 0)
        return found;

      lastCollision = currentCollision;
    }

  return found;

