seryi2035/stm32002/proj005cmakeC6T6/Core/src/main.c
}
uint8_t OW_Reset(void) {
  uint16_t status=0;

  //(на всякий случай подождём побольше, так как могут быть неточности в задержке)
  return (status);//вернём результат
}
void OW_SendBits(uint8_t num_bits) {
DMA_InitTypeDef DMA_InitStructure;

// внутренняя процедура. Записывает указанное число бит
  // DMA на чтение
  DMA_DeInit(OW_DMA_CH_RX);
  DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t) &(USART2->DR);
  DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t) ow_buf;
  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
  DMA_InitStructure.DMA_BufferSize = num_bits;
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
  DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
  DMA_InitStructure.DMA_Priority = DMA_Priority_Low;
  DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
  DMA_Init(OW_DMA_CH_RX, &DMA_InitStructure);

  // DMA на запись
  DMA_DeInit(OW_DMA_CH_TX);
  DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t) &(USART2->DR);
  DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t) ow_buf;
  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
  DMA_InitStructure.DMA_BufferSize = num_bits;
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
  DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
  DMA_InitStructure.DMA_Priority = DMA_Priority_Low;
  DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
  DMA_Init(OW_DMA_CH_TX, &DMA_InitStructure);

  // старт цикла отправки
  USART_ClearFlag(OW_USART, USART_FLAG_RXNE | USART_FLAG_TC | USART_FLAG_TXE);
  USART_DMACmd(OW_USART, USART_DMAReq_Tx | USART_DMAReq_Rx, ENABLE);
  DMA_Cmd(OW_DMA_CH_RX, ENABLE);
  DMA_Cmd(OW_DMA_CH_TX, ENABLE);

  // Ждем, пока не примем 8 байт
  while (DMA_GetFlagStatus(OW_DMA_FLAG) == RESET) {
#ifdef OW_GIVE_TICK_RTOS
      taskYIELD();
#endif
    }

  // отключаем DMA
  DMA_Cmd(OW_DMA_CH_TX, DISABLE);
  DMA_Cmd(OW_DMA_CH_RX, DISABLE);
  USART_DMACmd(OW_USART, USART_DMAReq_Tx | USART_DMAReq_Rx, DISABLE);
}
void OW_toBits(uint8_t ow_byte, uint8_t *ow_bits) {

//-----------------------------------------------------------------------------
// функция преобразует один байт в восемь, для передачи через USART
// ow_byte - байт, который надо преобразовать
// ow_bits - ссылка на буфер, размером не менее 8 байт
//-----------------------------------------------------------------------------
        uint8_t i;
        for (i = 0; i < 8; i++) {
                if (ow_byte & 0x01) {
                        *ow_bits = OW_1;
                } else {
                        *ow_bits = OW_0;
                }
                ow_bits++;
                ow_byte = ow_byte >> 1;
        }
}
uint8_t OW_toByte(uint8_t *ow_bits) {


//-----------------------------------------------------------------------------
// обратное преобразование - из того, что получено через USART опять собирается байт
// ow_bits - ссылка на буфер, размером не менее 8 байт
//-----------------------------------------------------------------------------
        uint8_t ow_byte, i;
        ow_byte = 0;
        for (i = 0; i < 8; i++) {
                ow_byte = ow_byte >> 1;
                if (*ow_bits == OW_R_1) {
                        ow_byte |= 0x80;
                }
                ow_bits++;
        }

        return ow_byte;
}



void OneWire_Init(void) {
  void port_init(void);
  GPIO_SetBits(GPIOB, GPIO_Pin_11);
  delay_us(100);
  GPIO_ResetBits(GPIOB, GPIO_Pin_11);
  delay_us(100);
  GPIO_SetBits(GPIOB, GPIO_Pin_11);
  delay_us(200);
}
//--------------------------------------------------
void port_init(void)
{
  //HAL_GPIO_DeInit(GPIOB, GPIO_PIN_11);
  GPIO_InitTypeDef GPIO_InitStructure;
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
  // B11 PP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  /*GPIOB->CRH |= GPIO_CRH_MODE11;
  GPIOB->CRH |= GPIO_CRH_CNF11_0;
  GPIOB->CRH &= ~GPIO_CRH_CNF11_1;*/
}
void port_initREAD(void)
{
  //HAL_GPIO_DeInit(GPIOB, GPIO_PIN_11);
  GPIO_InitTypeDef GPIO_InitStructure;
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
  // B11 PP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  /*GPIOB->CRH |= GPIO_CRH_MODE11;
  GPIOB->CRH |= GPIO_CRH_CNF11_0;
  GPIOB->CRH &= ~GPIO_CRH_CNF11_1;*/
}
void port_initIPU(void) {
  GPIO_InitTypeDef GPIO_InitStructure;
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
  // B11 PP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
}

//--------------------------------------------------
uint8_t ds18b20_Reset(void)
{
  uint8_t status;
  port_init();

  GPIO_ResetBits(GPIOB, GPIO_Pin_11);
  delay_us(480);//задержка как минимум на 480 микросекунд
  //GPIOB->ODR |= GPIO_ODR_ODR11;//высокий уровень
  GPIO_SetBits(GPIOB, GPIO_Pin_11);
  delay_us(70);//задержка как минимум на 60 микросекунд
  //status = GPIOB->IDR & GPIO_IDR_IDR11;//проверяем уровень
  port_initREAD();
  status = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_11);
  delay_us(410);//задержка как минимум на 480 микросекунд
  //(на всякий случай подождём побольше, так как могут быть неточности в задержке)
  return (status);//вернём результат
}
//----------------------------------------------------------
uint8_t ds18b20_ReadBit(void)
{
  uint8_t bit = 0;
  port_init();

  GPIO_ResetBits(GPIOB, GPIO_Pin_11);
  delay_us(2);

  port_initREAD();
  delay_us(10);
  if (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_11)) {
    bit = 1;
  }

  delay_us(50);
  return bit;
}
//-----------------------------------------------
uint8_t ds18b20_ReadByte(void)
{
  uint8_t data = 0;
  for (uint8_t i = 0; i <= 7; i++) {
    data += ds18b20_ReadBit() << i;
  }
  return data;
}
//-----------------------------------------------
void ds18b20_WriteBit(uint8_t bit){
  if (bit)      { // Send '1'
    port_init();
    GPIO_ResetBits(GPIOB, GPIO_Pin_11);
    delay_us(6);

    port_initIPU();  // Release bus - bit high by pullup
    delay_us(64);
  } else { // Send '0'
    port_init();
    GPIO_ResetBits(GPIOB, GPIO_Pin_11);
    delay_us(60);

    port_initIPU();  // Release bus - bit high by pullup
    delay_us(10);
  }
}
//-----------------------------------------------
void ds18b20_WriteByte(uint8_t byte)
{
        uint8_t i = 8;

        do
        {
                ds18b20_WriteBit(byte & 1); // LSB first
                byte >>= 1;
        } while(--i);
}
//-----------------------------------------------
uint8_t ds18b20_init(void)
{
        if(ds18b20_Reset()) return 1;

