seryi2035/stm32002/proj005cmakeC6T6/Core/src/main.c
  return 0;
}
//----------------------------------------------------------
void ds18b20_MeasureTemperCmd( void)
{
  ds18b20_Reset();

    //SKIP ROM
  ds18b20_WriteByte(0xCC);

  //CONVERT T
  ds18b20_WriteByte(0x44);
}
//----------------------------------------------------------
void ds18b20_ReadStratcpad(uint8_t mode, uint8_t *Data, uint8_t *commandID)
{
  uint8_t i;
  ds18b20_Reset();
  if(mode==SKIP_ROM)
  {
    //SKIP ROM
    ds18b20_WriteByte(0xCC);
  }
        else
        {
                //Match Rom
                ds18b20_WriteByte(0x55);
                for(i=0;i<=7;i++)
                {
                        ds18b20_WriteByte(commandID[i]);
                }
        }
  //READ SCRATCHPAD
  ds18b20_WriteByte(0xBE);
  for(i=0;i<8;i++)
  {
    Data[i] = ds18b20_ReadByte();
  }
}
uint16_t ds18b20_ReadStratcpad003(uint8_t *commandID)
{
  uint8_t i;
  uint8_t buf[2];

  ds18b20_Reset();

                //Match Rom
                ds18b20_WriteByte(0x55);
                for(i=0;i<=7;i++)
                {
                        ds18b20_WriteByte(commandID[i]);
                }
  //READ SCRATCHPAD
  ds18b20_WriteByte(0xBE);
  for(i=0;i<2;i++)
  {
    buf[i] = ds18b20_ReadByte();
  }
  return ((uint16_t) ((buf[1]<<8) + (buf[0])));
}
//----------------------------------------------------------
uint8_t ds18b20_GetSign(uint16_t dt)
{
  //Проверим 11-й бит
  if (dt&(1<<11)) return 1;
  else return 0;
}
//----------------------------------------------------------
float ds18b20_Convert(uint16_t dt)
{
  float t;
  t = (float) ((dt&0x07FF)>>4); //отборосим знаковые и дробные биты
  //Прибавим дробную часть
  t += (float)(dt&0x000F) / 16.0f;
  return t;
}
